import userInterface.Entrance;
import userInterface.PasswordAuthentication;

/**
 * Created by maximgrozniy on 18.08.15.
 */

//                          Автоматизоване робоче місце.
//
//        Необхідно автоматизувати роботу невеликого підприємства по роботі з складом.
//
//        Існує декілька груп товарів (наприклад: Продовольчі, непродовольчі...).
//        В кожній групі товарів існують конкретні товари (наприклад: борошно, гречка ...).
//        У кожного товару є наступні властивості - назва, опис, виробник, кількість на складі, ціна за одиницю.
//        Група товарів містить наступні властивості - назва, опис.
//
//        Реалізувати:
//
//        Реалізувати графічний інтерфейс користувача
//        Збереження даних в базу даних SQLite
//        Назва товару - унікальна (не може зустрічатися більше в жодній групі товарів).
//        Назва групи товарів - унікальна.
//        Реалізувати додавання/редагування/видалення групи товарів - при видаленні групи товарів, видаляти і всі товари.
//        Реалізувати додавання/редагування/видалення товару в групу товарів (мається на увазі назва, опис, виробник, ціна за одиницю).
//        Реалізувати інтерфейс додавання товару (прийшло на склад крупи гречаної - 10 штук), інтерфейс списання товару (продали крупи гречаної - 5 шт.)
//        Пошук товару.
//        Вивід статистичних даних: вивід всіх товарів з інформацією по складу, вивід усіх товарів по групі товарів з інформацією, загальна вартість товару на складі (кількість * на ціну), загальна вартість товарів в групі товарів.
//        Як додаткове завдання створити клієнт серверне застосування використовуючи сокети. На сервері зберігається база даних і серверне застосування оброблює запити від клієнтів. Клієнти - графічний інтерфейс.
//        Як додаткове завдання додати ролі (Адміністратор, Менеджер)


public class Main {
    public static void main(String[] args) {

        Entrance entrance = new Entrance(new PasswordAuthentication("","qwerty", "zxcvb"));
    }

}
